#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stackhpc/github-demo-org/runs/run-Rq4YF8kUv518JDKb

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
github_repository.repositories["cloudkitty"]: Refreshing state... [id=cloudkitty]
github_repository.repositories["ansible-role-os-images"]: Refreshing state... [id=ansible-role-os-images]
data.github_repository.repositories["cloudkitty"]: Reading...
data.github_repository.repositories["ansible-role-os-images"]: Reading...
data.github_repository.repositories["cloudkitty"]: Read complete after 0s [id=cloudkitty]
data.github_repository.repositories["ansible-role-os-images"]: Read complete after 0s [id=ansible-role-os-images]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_branch_protection.ansible_branch_protection["ansible-role-os-images"] will be created
  + resource "github_branch_protection" "ansible_branch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "master"
      + push_restrictions               = (known after apply)
      + repository_id                   = "ansible-role-os-images"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }
    }

  # github_branch_protection.openstack_branch_protection["cloudkitty"] will be created
  + resource "github_branch_protection" "openstack_branch_protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "stackhpc/**"
      + push_restrictions               = (known after apply)
      + repository_id                   = "cloudkitty"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "tox / Tox pep8 with Python 3.8",
              + "tox / Tox py36 with Python 3.6",
              + "tox / Tox py38 with Python 3.8",
            ]
          + strict   = true
        }
    }

  # github_issue_label.community_files_label["ansible-role-os-images"] will be created
  + resource "github_issue_label" "community_files_label" {
      + color       = "3F84E5"
      + description = "Community files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "community-files"
      + repository  = "ansible-role-os-images"
      + url         = (known after apply)
    }

  # github_issue_label.community_files_label["cloudkitty"] will be created
  + resource "github_issue_label" "community_files_label" {
      + color       = "3F84E5"
      + description = "Community files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "community-files"
      + repository  = "cloudkitty"
      + url         = (known after apply)
    }

  # github_issue_label.stackhpc_label["ansible-role-os-images"] will be created
  + resource "github_issue_label" "stackhpc_label" {
      + color       = "E6E2C0"
      + description = "Automated action performed by stackhpc-ci"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "stackhpc-ci"
      + repository  = "ansible-role-os-images"
      + url         = (known after apply)
    }

  # github_issue_label.stackhpc_label["cloudkitty"] will be created
  + resource "github_issue_label" "stackhpc_label" {
      + color       = "E6E2C0"
      + description = "Automated action performed by stackhpc-ci"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "stackhpc-ci"
      + repository  = "cloudkitty"
      + url         = (known after apply)
    }

  # github_issue_label.workflows_label["ansible-role-os-images"] will be created
  + resource "github_issue_label" "workflows_label" {
      + color       = "638475"
      + description = "Workflow files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "workflows"
      + repository  = "ansible-role-os-images"
      + url         = (known after apply)
    }

  # github_issue_label.workflows_label["cloudkitty"] will be created
  + resource "github_issue_label" "workflows_label" {
      + color       = "638475"
      + description = "Workflow files have been modified"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "workflows"
      + repository  = "cloudkitty"
      + url         = (known after apply)
    }

  # github_repository.repositories["cloudkitty"] will be updated in-place
  ~ resource "github_repository" "repositories" {
      ~ delete_branch_on_merge = false -> true
        id                     = "cloudkitty"
        name                   = "cloudkitty"
        # (28 unchanged attributes hidden)
    }

  # github_team.organisation_teams["Ansible"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for Ansible development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Ansible"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["Azimuth"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for Azimuth development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Azimuth"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["Batch"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for Batch development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Batch"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["Developers"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "All employees are a member of this team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Developers"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["Kayobe"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for Kayobe development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "Kayobe"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["OpenStack"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for OpenStack development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "OpenStack"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["ReleaseTrain"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for Release Train development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ReleaseTrain"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.organisation_teams["SMSLab"] will be created
  + resource "github_team" "organisation_teams" {
      + create_default_maintainer = false
      + description               = "Team responsible for SMS Lab development"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "SMSLab"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.team_membership["Ansible"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["Azimuth"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["Batch"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["Developers"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["Kayobe"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["OpenStack"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["ReleaseTrain"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_members.team_membership["SMSLab"] will be created
  + resource "github_team_members" "team_membership" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "jackhodgkiss"
        }
    }

  # github_team_repository.ansible_repositories["ansible-role-os-images"] will be created
  + resource "github_team_repository" "ansible_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "ansible-role-os-images"
      + team_id    = (known after apply)
    }

  # github_team_repository.developers_repositories["ansible-role-os-images"] will be created
  + resource "github_team_repository" "developers_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "ansible-role-os-images"
      + team_id    = (known after apply)
    }

  # github_team_repository.developers_repositories["cloudkitty"] will be created
  + resource "github_team_repository" "developers_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "cloudkitty"
      + team_id    = (known after apply)
    }

  # github_team_repository.openstack_repositories["cloudkitty"] will be created
  + resource "github_team_repository" "openstack_repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cloudkitty"
      + team_id    = (known after apply)
    }

Plan: 28 to add, 1 to change, 0 to destroy.


```

</details>

*Pusher: @jackhodgkiss, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*